{
  "plugins": {
    "Comment.nvim": {
      "src": "https://github.com/numToStr/Comment.nvim",
      "version": "'e30b7f2008e52442154b66f7c519bfd2f1e32acb'"
    },
    "LuaSnip": {
      "src": "https://github.com/L3MON4D3/LuaSnip",
      "version": "'v2.4.1'"
    },
    "SchemaStore.nvim": {
      "src": "https://github.com/b0o/SchemaStore.nvim"
    },
    "bufferline.nvim": {
      "src": "https://github.com/akinsho/bufferline.nvim",
      "version": "'v4.9.1'"
    },
    "cmp-nvim-lsp": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lsp",
      "version": "'cbc7b02bb99fae35cb42f514762b89b5126651ef'"
    },
    "cmp-nvim-lsp-signature-help": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lsp-signature-help",
      "version": "'fd3e882e56956675c620898bf1ffcf4fcbe7ec84'"
    },
    "cmp-nvim-lua": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lua",
      "version": "'e3a22cb071eb9d6508a156306b102c45cd2d573d'"
    },
    "cmp-path": {
      "src": "https://github.com/hrsh7th/cmp-path",
      "version": "'c642487086dbd9a93160e1679a1327be111cbc25'"
    },
    "cmp_luasnip": {
      "src": "https://github.com/saadparwaiz1/cmp_luasnip",
      "version": "'98d9cb5c2c38532bd9bdb481067b20fea8f32e90'"
    },
    "dressing.nvim": {
      "src": "https://github.com/stevearc/dressing.nvim",
      "version": "'v2.2.1'"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets",
      "version": "'6cd7280adead7f586db6fccbd15d2cac7e2188b9'"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim",
      "version": "'v2.1.0'"
    },
    "indent-blankline.nvim": {
      "src": "https://github.com/lukas-reineke/indent-blankline.nvim",
      "version": "'v3.9.1'"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim",
      "version": "'v2.2.1'"
    },
    "none-ls.nvim": {
      "src": "https://github.com/nvimtools/none-ls.nvim",
      "version": "'6ad251ef07dd4ba0cc725a5553cc76e9923f1a4a'"
    },
    "nvim-autopairs": {
      "src": "https://github.com/windwp/nvim-autopairs",
      "version": "'59bce2eef357189c3305e25bc6dd2d138c1683f5'"
    },
    "nvim-cmp": {
      "src": "https://github.com/hrsh7th/nvim-cmp",
      "version": "'a1d504892f2bc56c2e79b65c6faded2fd21f3eca'"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig",
      "version": "'v2.7.0'"
    },
    "nvim-tree.lua": {
      "src": "https://github.com/nvim-tree/nvim-tree.lua",
      "version": "'v1.16.0'"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'main'"
    },
    "nvim-ts-autotag": {
      "src": "https://github.com/windwp/nvim-ts-autotag"
    },
    "nvim-ts-context-commentstring": {
      "src": "https://github.com/JoosepAlviste/nvim-ts-context-commentstring",
      "version": "'6141a40173c6efa98242dc951ed4b6f892c97027'"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons",
      "version": "'40e9d5a6cc3db11b309e39593fc7ac03bb844e38'"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim",
      "version": "'b9fd5226c2f76c951fc8ed5923d85e4de065e509'"
    },
    "project.nvim": {
      "src": "https://github.com/ahmedkhalf/project.nvim",
      "version": "'8c6bad7d22eef1b71144b401c9f74ed01526a4fb'"
    },
    "telescope-undo.nvim": {
      "src": "https://github.com/debugloop/telescope-undo.nvim",
      "version": "'928d0c2dc9606e01e2cc547196f48d2eaecf58e5'"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim",
      "version": "'v0.2.1'"
    },
    "toggleterm.nvim": {
      "src": "https://github.com/akinsho/toggleterm.nvim",
      "version": "'v2.13.1'"
    },
    "vim-bbye": {
      "src": "https://github.com/moll/vim-bbye",
      "version": "'25ef93ac5a87526111f43e5110675032dbcacf56'"
    },
    "vim-enfocado": {
      "src": "https://github.com/wuelnerdotexe/vim-enfocado"
    },
    "vim-sleuth": {
      "src": "https://github.com/tpope/vim-sleuth",
      "version": "'v2.0'"
    }
  }
}
